УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Партнеры/КонтурЛогистика_Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Партнеры</name>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДЭлПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОрганизацииДиадок</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ГО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Диспетчер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Медик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Техник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>boxId</name>
      <comment>ящик диадок (на случай если роуминг или несколько провайдеров)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Настройки</types>
        <types>CatalogRef.КонтурЛогистика_НастройкиПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
        <types>CatalogRef.КонтурЛогистика_Лицензии</types>
        <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
        <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
        <types>CatalogRef.Валюты</types>
        <types>EnumRef.КонтурЛогистика_МастерДанныеСотрудников</types>
        <types>CatalogRef.Контрагенты</types>
        <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
        <types>Boolean</types>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
        <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
        <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>CatalogRef.Организации</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
        <types>String</types>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>CatalogRef.Пользователи</types>
        <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.ТранспортныеСредства</types>
        <types>CatalogRef.Партнеры</types>
        <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>EnumRef.КонтурЛогистика_ВариантыВалидации</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
        <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
        <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
        <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
        <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
        <types>CatalogRef.ЗоныДоставки</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыМаршрута</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИндекс</name>
      <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКодРегион</name>
      <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИнфКодСтраны</name>
      <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресГород</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресНаселПункт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресУлица</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресРайон</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДом</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКорпус</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКварт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прибытие</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Партнеры/ManagerModule.bsl
Функция ОпределитьПартнераОрганизацииДиадок(ОрганизацияДиадок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПартнерыОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_Партнеры.ОрганизацииДиадок КАК КонтурЛогистика_ПартнерыОрганизацииДиадок
	|ГДЕ
	|	КонтурЛогистика_ПартнерыОрганизацииДиадок.Организация = &Организация
	|	И НЕ КонтурЛогистика_ПартнерыОрганизацииДиадок.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Организация",ОрганизацияДиадок);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

Функция ЗначениеНастройки(ПартнерСсылка, Знач НастройкаПартнераИлиОбщая) Экспорт 
	
	Если ТипЗнч(НастройкаПартнераИлиОбщая) = Тип("Строка") Тогда
		
		// по имени настройки поищем сначала в партнере а потом общую
		
		НастройкаПартнераИлиОбщая = Справочники.КонтурЛогистика_НастройкиПартнеров.ПолучитьСсылкуПоИмениПредопределенного(НастройкаПартнераИлиОбщая);
		Если Не ЗначениеЗаполнено(НастройкаПартнераИлиОбщая) Тогда 
			НастройкаПартнераИлиОбщая = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(НастройкаПартнераИлиОбщая);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НастройкаПартнераИлиОбщая) Тогда 
			ВызватьИсключение "Не существует настройки с именем " + НастройкаПартнераИлиОбщая + " ни в справочнике настроек партнера, ни в справочнике общих настроек";
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_Партнеры.Значение КАК ЗначениеНастройки
	               |ИЗ
	               |	Справочник.КонтурЛогистика_Партнеры.Настройки КАК КонтурЛогистика_Партнеры
	               |ГДЕ
	               |	КонтурЛогистика_Партнеры.Ссылка = &Ссылка
	               |	И КонтурЛогистика_Партнеры.Настройка = &Настройка
	               |	И НЕ КонтурЛогистика_Партнеры.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ПартнерСсылка);
	Запрос.УстановитьПараметр("Настройка", НастройкаПартнераИлиОбщая);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ЗначениеНастройки;
	Иначе
		Возврат НастройкаПартнераИлиОбщая.Значение;
	КонецЕсли;
	
КонецФункции

// тех у которых есть КодПартнераКонтур
Функция МассивСинхронизируемыхПартнеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_Партнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_Партнеры КАК КонтурЛогистика_Партнеры
	|ГДЕ
	|	НЕ КонтурЛогистика_Партнеры.ПометкаУдаления
	|	И КонтурЛогистика_Партнеры.КодПартнераКонтур <> """"";
	
	Результат = Запрос.Выполнить();
	МассивПартнеров = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
	Возврат МассивПартнеров;
	
КонецФункции

Функция ДобавленныеПартнеры() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КонтурЛогистика_Партнеры.КодПартнераКонтур КАК КодПартнераКонтур
	               |ИЗ
	               |	Справочник.КонтурЛогистика_Партнеры КАК КонтурЛогистика_Партнеры
	               |ГДЕ
	               |	НЕ КонтурЛогистика_Партнеры.ПометкаУдаления
	               |	И КонтурЛогистика_Партнеры.КодПартнераКонтур <> """"";
	
	Результат = Запрос.Выполнить();
	МассивКодовПартнеров = Результат.Выгрузить().ВыгрузитьКолонку("КодПартнераКонтур");	
	
	Возврат МассивКодовПартнеров;

КонецФункции
